{"title": "The Hypocrisy of Presidential Pardons", "md_content": "# The Hypocrisy of Presidential Pardons\n\n\n\n#### By William B. Chastain - 01/23/2025\n\n\n\nThe GOP prides itself on being the party of ‘law and order’. Their outspoken support for police officers and\n\ntough-on-crime policies underscore this idea; however, this ideal has recently come into question following a blanket\n\npardon of January 6th rioters by President Donald Trump.\n\n\n\nPresident Trump’s pardon was all-encompassing. Most violent offenders, those who assaulted and injured Capitol Police,\n\nwere included. Asked about how this is compatible with the GOP’s stance on law enforcement, House Speaker Mike Johnson\n\nbeat around the bush without a clear answer, saying “The President’s made his decision. I don’t second-guess those”.\n\nThis starkly contrasts with his response to former president Joe Biden’s last-minute pardons – which included his\n\nfamily, members of the January 6th committee, and others such as Dr. Anthony Fauci to protect them from potentially\n\nvengeful actions by President Trump – which he called “shocking” and “disgusting”.\n\n\n\nThe hypocrisy is staggering; the leader of a party that once claimed to be law enforcement’s best friend is now\n\nresponsible for the release of hundreds of criminals guilty of assaulting police officers. Mind you, the vast majority\n\nof those pardoned pleaded guilty to their crimes. Several who were already in prison had their sentences commuted,\n\nincluding those convicted or otherwise charged with engaging in the separate seditious conspiracies mounted by leaders\n\nof the Proud Boys and Oath Keepers to thwart the lawful transfer of power. It should be noted that several Republicans\n\ndenounced Trump’s blanket pardoning, including the likes of Senator Thom Tillis of North Carolina, Senator Bill Cassidy\n\nof Louisiana, and Senator Lisa Murkowski of Alaska, however many remain silent.\n\n\n\nIt’s easy to pick on Republicans for this sort of thing, as President Trump is more willing to break from tradition than\n\nhis recent predecessors. Even so, Democrats too have had their moments. Joe Biden presented himself as a return to\n\nnormalcy, the solution to Trump’s alleged abuse of power and lack of integrity. Despite this and his promises not to do\n\nso, the former president pardoned his son Hunter within the final two months of his term, claiming a “miscarriage of\n\njustice” had taken place. Special counsel David Weiss barked back at Biden, saying “The President’s statements unfairly\n\nimpugn the integrity… of Department of Justice personnel”. The pardons were related to charges against Hunter Biden,\n\nincluding lying on a gun application about his drug use and in a separate case, three felony tax offenses and six\n\nmisdemeanor offenses. According to Weiss, “both cases [were] proven beyond a reasonable doubt” and were not politically\n\nmotivated, writing he “prosecuted the two cases against [Hunter] Biden because he broke the law” in a final report. As a\n\nresult, in similar fashion to Trump’s blanket pardons, several high-profile Democrats spoke out against Biden, but many\n\nmore were silent or their stance ambiguous.\n\n\n\nThis trend is alarming. Without their parties and voters holding them accountable, recent presidents have pushed the\n\nboundaries of what actions can be taken in line with their party’s goals. Pardoning violent rioters that injured roughly\n\n140 police officers and killed five is certainly against the GOP’s values while lying to the populace about your\n\nintention to pardon your family members goes against the supposed integrity of the Democratic party. It’s up to us, the\n\npeople, to speak up, to make our voices heard. Presidents can only assume power with the support of the people; so it’s\n\non us to make it clear, we don’t like the presidential pass.\n", "tags": ["op-eds"], "date_created": "2025-01-23T19:26:39.002647", "date_last_modified": "2025-04-04T19:26:57.923276"}